{
  "extName": {
    "message": "Weave: Στιγμιότυπο οθόνης & λήψη πλήρους σελίδας",
    "description": "Το επίσημο όνομα της επέκτασης. Διατηρείται συνοπτικό για την ορατότητα στο κατάστημα ιστού και την επωνυμία."
  },
  "extDescription": {
    "message": "Αποτυπώστε και συνδυάστε απρόσκοπτα στιγμιότυπα οθόνης πλήρους σελίδας με κύλιση με ένα κλικ. Προβάλετε, κατεβάστε ή αντιγράψτε τις λήψεις σας αμέσως.",
    "description": "Η περιγραφή μάρκετινγκ της επέκτασης, με επίκεντρο τα οφέλη και την ευκολία χρήσης."
  },
  "actionTitle": {
    "message": "Λήψη με το Weave",
    "description": "Συμβουλή εργαλείου για το κουμπί δράσης του προγράμματος περιήγησης. Σύντομο, με επωνυμία και προσανατολισμένο στη δράση."
  },
  "optionsTitle": {
    "message": "Ρυθμίσεις Weave",
    "description": "Τίτλος της καρτέλας του προγράμματος περιήγησης της σελίδας επιλογών."
  },
  "optionsHeader": {
    "message": "Ρυθμίσεις",
    "description": "Κύρια κεφαλίδα στη σελίδα επιλογών. Καθαρή και απλή."
  },
  "defaultActionHeader": {
    "message": "Μετά τη λήψη...",
    "description": "Κεφαλίδα για τη ρύθμιση της προεπιλεγμένης ενέργειας. Πιο διαισθητική και προσανατολισμένη στη ροή εργασίας."
  },
  "defaultActionDescription": {
    "message": "Επιλέξτε τι κάνει το Weave τη στιγμή που ολοκληρώνεται μια λήψη.",
    "description": "Περιγραφή για τη ρύθμιση της προεπιλεγμένης ενέργειας."
  },
  "openViewerLabel": {
    "message": "Άνοιγμα προβολέα",
    "description": "Ετικέτα για το κουμπί ραδιοφώνου 'άνοιγμα στον προβολέα'. Σαφής και άμεση."
  },
  "downloadLabel": {
    "message": "Λήψη",
    "description": "Ετικέτα για το κουμπί ραδιοφώνου 'λήψη'. Κατανοητή παγκοσμίως."
  },
  "copyLabel": {
    "message": "Αντιγραφή",
    "description": "Ετικέτα για το κουμπί ραδιοφώνου 'αντιγραφή'. Συνοπτική για τη συνέπεια του περιβάλλοντος εργασίας χρήστη."
  },
  "saveAsHeader": {
    "message": "Ερώτηση πριν από την αποθήκευση",
    "description": "Κεφαλίδα για τον διακόπτη 'αποθήκευση ως'. Διατυπωμένη από την οπτική γωνία του χρήστη."
  },
  "saveAsDescription": {
    "message": "Εάν είναι ενεργοποιημένο, θα σας ζητηθεί να επιλέξετε ένα όνομα αρχείου και μια τοποθεσία για κάθε λήψη.",
    "description": "Περιγραφή για τον διακόπτη 'αποθήκευση ως'. Χρησιμοποιεί ενεργητική φωνή."
  },
  "scrollingHeader": {
    "message": "Ενεργοποίηση λήψης με κύλιση",
    "description": "Κεφαλίδα για τη ρύθμιση του διακόπτη λήψης με κύλιση."
  },
  "scrollingDescription": {
    "message": "Ενεργοποιήστε για να αποτυπώσετε ολόκληρη τη σελίδα με κύλιση. Απενεργοποιήστε για να αποτυπώσετε μόνο την τρέχουσα ορατή περιοχή.",
    "description": "Περιγραφή για τον διακόπτη λήψης με κύλιση. Πιο άμεση και επιτακτική."
  },
  "supportHeader": {
    "message": "Υποστηρίξτε αυτό το έργο",
    "description": "Κεφαλίδα για την ενότητα υποστήριξης/χορηγίας. Πιο προσωπική και εστιασμένη στην κοινότητα."
  },
  "supportDescription": {
    "message": "Το Weave είναι ένα δωρεάν έργο ανοιχτού κώδικα. Αν το βρίσκετε χρήσιμο, παρακαλούμε εξετάστε το ενδεχόμενο να υποστηρίξετε τη συνεχή ανάπτυξή του.",
    "description": "Περιγραφή για την ενότητα υποστήριξης. Επισημαίνει την πρόταση αξίας (FOSS)."
  },
  "sponsorButton": {
    "message": "Χορηγία στο GitHub",
    "description": "Κείμενο για το κουμπί χορηγίας."
  },
  "viewerTitle": {
    "message": "Weave: Η λήψη ολοκληρώθηκε",
    "description": "Τίτλος της καρτέλας του προγράμματος περιήγησης της σελίδας προβολής στιγμιότυπου οθόνης."
  },
  "viewerHeader": {
    "message": "Η λήψη ολοκληρώθηκε",
    "description": "Κύρια κεφαλίδα στη σελίδα προβολής, επιβεβαιώνοντας την επιτυχία."
  },
  "viewerDescription": {
    "message": "Το στιγμιότυπο οθόνης πλήρους σελίδας είναι έτοιμο. Τι ακολουθεί;",
    "description": "Περιγραφή στη σελίδα προβολής, που εμπλέκει τον χρήστη."
  },
  "copyButton": {
    "message": "Αντιγραφή εικόνας",
    "description": "Κείμενο για το κουμπί αντιγραφής στη σελίδα προβολής."
  },
  "copiedButton": {
    "message": "Αντιγράφηκε!",
    "description": "Κείμενο για το κουμπί αντιγραφής μετά από μια επιτυχημένη αντιγραφή, παρέχοντας σαφή ανατροφοδότηση."
  },
  "downloadButton": {
    "message": "Λήψη εικόνας",
    "description": "Κείμενο για το κουμπί λήψης στη σελίδα προβολής."
  },
  "downloadingButton": {
    "message": "Γίνεται λήψη...",
    "description": "Κείμενο για το κουμπί λήψης κατά τη διάρκεια της λήψης."
  },
  "errorButton": {
    "message": "Απέτυχε",
    "description": "Κείμενο για ένα κουμπί όταν παρουσιάζεται σφάλμα. Λιγότερο ανησυχητικό από το 'Σφάλμα'."
  },
  "screenshotAltText": {
    "message": "Ένα στιγμιότυπο οθόνης πλήρους σελίδας που λήφθηκε από το Weave.",
    "description": "Εναλλακτικό κείμενο για την εικόνα του στιγμιότυπου οθόνης, βελτιώνοντας την προσβασιμότητα και την επωνυμία."
  },
  "noScreenshotAltText": {
    "message": "Δεν βρέθηκαν δεδομένα στιγμιότυπου οθόνης. Επιστρέψτε στην προηγούμενη καρτέλα και προσπαθήστε να κάνετε λήψη ξανά.",
    "description": "Εναλλακτικό κείμενο για την περιοχή της εικόνας όταν δεν υπάρχει διαθέσιμο στιγμιότυπο οθόνης, παρέχοντας μια σαφή οδηγία."
  },
  "copyFailedError": {
    "message": "Δεν ήταν δυνατή η αντιγραφή της εικόνας στο πρόχειρο. Αιτία: $details$",
    "description": "Μήνυμα σφάλματος που εμφανίζεται όταν αποτυγχάνει η αντιγραφή στο πρόχειρο. Πιο ήπια γλώσσα.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Η πρόσβαση στο πρόχειρο απορρίφθηκε."
      }
    }
  },
  "screenshotGenericError": {
    "message": "Κάτι πήγε στραβά κατά τη διαδικασία λήψης. Σφάλμα: $details$",
    "description": "Γενικό μήνυμα σφάλματος που εμφανίζεται όταν αποτυγχάνει η λήψη στιγμιότυπου οθόνης. Πιο κατανοητό από τον άνθρωπο.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Αποτυχία δημιουργίας καμβά."
      }
    }
  },
  "captureCancelledError": {
    "message": "Η λήψη ακυρώθηκε επειδή απομακρυνθήκατε. Για μια λήψη πλήρους σελίδας, παραμείνετε στην καρτέλα μέχρι να ολοκληρώσει το Weave.",
    "description": "Μήνυμα σφάλματος που εμφανίζεται όταν ο χρήστης αλλάζει καρτέλες. Εξηγεί *γιατί* και δίνει ευγενικές οδηγίες."
  }
}
