{
  "extName": {
    "message": "Weave: ภาพหน้าจอและจับภาพเต็มหน้า",
    "description": "ชื่ออย่างเป็นทางการของส่วนขยาย คงไว้ให้กระชับเพื่อการมองเห็นในเว็บสโตร์และการสร้างแบรนด์"
  },
  "extDescription": {
    "message": "จับภาพและเย็บภาพหน้าจอแบบเลื่อนเต็มหน้าได้อย่างราบรื่นในคลิกเดียว ดู ดาวน์โหลด หรือคัดลอกภาพที่คุณจับได้ทันที",
    "description": "คำอธิบายทางการตลาดของส่วนขยาย โดยเน้นที่ประโยชน์และความสะดวกในการใช้งาน"
  },
  "actionTitle": {
    "message": "จับภาพด้วย Weave",
    "description": "คำแนะนำเครื่องมือสำหรับปุ่มการทำงานของเบราว์เซอร์ สั้น มีตราสินค้า และมุ่งเน้นการดำเนินการ"
  },
  "optionsTitle": {
    "message": "การตั้งค่า Weave",
    "description": "ชื่อแท็บเบราว์เซอร์ของหน้าตัวเลือก"
  },
  "optionsHeader": {
    "message": "การตั้งค่า",
    "description": "หัวเรื่องหลักในหน้าตัวเลือก สะอาดและเรียบง่าย"
  },
  "defaultActionHeader": {
    "message": "หลังจากการจับภาพ...",
    "description": "หัวเรื่องสำหรับการตั้งค่าการดำเนินการเริ่มต้น ใช้งานง่ายและมุ่งเน้นเวิร์กโฟลว์มากขึ้น"
  },
  "defaultActionDescription": {
    "message": "เลือกสิ่งที่ Weave จะทำในทันทีที่การจับภาพเสร็จสิ้น",
    "description": "คำอธิบายสำหรับการตั้งค่าการดำเนินการเริ่มต้น"
  },
  "openViewerLabel": {
    "message": "เปิดในโปรแกรมดู",
    "description": "ป้ายกำกับสำหรับปุ่มตัวเลือก 'เปิดในโปรแกรมดู' ชัดเจนและตรงไปตรงมา"
  },
  "downloadLabel": {
    "message": "ดาวน์โหลด",
    "description": "ป้ายกำกับสำหรับปุ่มตัวเลือก 'ดาวน์โหลด' เข้าใจได้ในระดับสากล"
  },
  "copyLabel": {
    "message": "คัดลอก",
    "description": "ป้ายกำกับสำหรับปุ่มตัวเลือก 'คัดลอก' กระชับเพื่อความสอดคล้องของ UI"
  },
  "saveAsHeader": {
    "message": "ถามก่อนบันทึก",
    "description": "หัวเรื่องสำหรับสลับ 'บันทึกเป็น' เรียบเรียงจากมุมมองของผู้ใช้"
  },
  "saveAsDescription": {
    "message": "หากเปิดใช้งาน คุณจะได้รับแจ้งให้เลือกชื่อไฟล์และตำแหน่งสำหรับการดาวน์โหลดแต่ละครั้ง",
    "description": "คำอธิบายสำหรับสลับ 'บันทึกเป็น' ใช้เสียงที่กระตือรือร้น"
  },
  "scrollingHeader": {
    "message": "เปิดใช้งานการจับภาพแบบเลื่อน",
    "description": "หัวเรื่องสำหรับการตั้งค่าสลับการจับภาพแบบเลื่อน"
  },
  "scrollingDescription": {
    "message": "เปิดใช้งานเพื่อจับภาพทั้งหน้าที่เลื่อนได้ ปิดใช้งานเพื่อจับภาพเฉพาะพื้นที่ที่มองเห็นได้ในปัจจุบัน",
    "description": "คำอธิบายสำหรับสลับการจับภาพแบบเลื่อน ตรงไปตรงมาและบังคับมากขึ้น"
  },
  "supportHeader": {
    "message": "สนับสนุนโครงการนี้",
    "description": "หัวเรื่องสำหรับส่วนการสนับสนุน/การสนับสนุน เป็นส่วนตัวและมุ่งเน้นชุมชนมากขึ้น"
  },
  "supportDescription": {
    "message": "Weave เป็นโครงการโอเพ่นซอร์สฟรี หากคุณพบว่ามีประโยชน์ โปรดพิจารณาสนับสนุนการพัฒนาอย่างต่อเนื่อง",
    "description": "คำอธิบายสำหรับส่วนการสนับสนุน เน้นข้อเสนอคุณค่า (FOSS)"
  },
  "sponsorButton": {
    "message": "สนับสนุนบน GitHub",
    "description": "ข้อความสำหรับปุ่มผู้สนับสนุน"
  },
  "viewerTitle": {
    "message": "Weave: การจับภาพเสร็จสมบูรณ์",
    "description": "ชื่อแท็บเบราว์เซอร์ของหน้าโปรแกรมดูภาพหน้าจอ"
  },
  "viewerHeader": {
    "message": "การจับภาพเสร็จสมบูรณ์",
    "description": "หัวเรื่องหลักในหน้าโปรแกรมดู ยืนยันความสำเร็จ"
  },
  "viewerDescription": {
    "message": "ภาพหน้าจอเต็มหน้าของคุณพร้อมแล้ว ต่อไปคืออะไร?",
    "description": "คำอธิบายในหน้าโปรแกรมดู ดึงดูดผู้ใช้"
  },
  "copyButton": {
    "message": "คัดลอกรูปภาพ",
    "description": "ข้อความสำหรับปุ่มคัดลอกในหน้าโปรแกรมดู"
  },
  "copiedButton": {
    "message": "คัดลอกแล้ว!",
    "description": "ข้อความสำหรับปุ่มคัดลอกหลังจากการคัดลอกสำเร็จ ให้ข้อเสนอแนะที่ชัดเจน"
  },
  "downloadButton": {
    "message": "ดาวน์โหลดรูปภาพ",
    "description": "ข้อความสำหรับปุ่มดาวน์โหลดในหน้าโปรแกรมดู"
  },
  "downloadingButton": {
    "message": "กำลังดาวน์โหลด...",
    "description": "ข้อความสำหรับปุ่มดาวน์โหลดขณะกำลังดาวน์โหลด"
  },
  "errorButton": {
    "message": "ล้มเหลว",
    "description": "ข้อความสำหรับปุ่มเมื่อเกิดข้อผิดพลาด น่ากลัวน้อยกว่า 'ข้อผิดพลาด'"
  },
  "screenshotAltText": {
    "message": "ภาพหน้าจอเต็มหน้าที่จับโดย Weave",
    "description": "ข้อความแสดงแทนสำหรับภาพหน้าจอ ปรับปรุงการเข้าถึงและการสร้างแบรนด์"
  },
  "noScreenshotAltText": {
    "message": "ไม่พบข้อมูลภาพหน้าจอ โปรดกลับไปที่แท็บก่อนหน้าและลองจับภาพอีกครั้ง",
    "description": "ข้อความแสดงแทนสำหรับพื้นที่รูปภาพเมื่อไม่มีภาพหน้าจอ ให้คำแนะนำที่ชัดเจน"
  },
  "copyFailedError": {
    "message": "ไม่สามารถคัดลอกรูปภาพไปยังคลิปบอร์ดได้ เหตุผล: $details$",
    "description": "ข้อความแสดงข้อผิดพลาดที่แสดงเมื่อการคัดลอกไปยังคลิปบอร์ดล้มเหลว ภาษาที่นุ่มนวลกว่า",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "การเข้าถึงคลิปบอร์ดถูกปฏิเสธ"
      }
    }
  },
  "screenshotGenericError": {
    "message": "เกิดข้อผิดพลาดบางอย่างระหว่างกระบวนการจับภาพ ข้อผิดพลาด: $details$",
    "description": "ข้อความแสดงข้อผิดพลาดทั่วไปที่แสดงเมื่อการจับภาพหน้าจอล้มเหลว อ่านง่ายขึ้นสำหรับมนุษย์",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "สร้างผืนผ้าใบไม่สำเร็จ"
      }
    }
  },
  "captureCancelledError": {
    "message": "การจับภาพถูกยกเลิกเนื่องจากคุณนำทางออกไป สำหรับการจับภาพเต็มหน้า โปรดอยู่ในแท็บจนกว่า Weave จะเสร็จสิ้น",
    "description": "ข้อความแสดงข้อผิดพลาดที่แสดงเมื่อผู้ใช้สลับแท็บ อธิบายว่า *ทำไม* และแนะนำอย่างสุภาพ"
  }
}
