{
  "extName": {
    "message": "वीव: पूर्ण पृष्ठ स्क्रीनशॉट और कैप्चर",
    "description": "एक्सटेंशन का आधिकारिक नाम। वेब स्टोर दृश्यता और ब्रांडिंग के लिए संक्षिप्त रखा गया है।"
  },
  "extDescription": {
    "message": "एक क्लिक में स्क्रॉलिंग, पूर्ण-पृष्ठ स्क्रीनशॉट को निर्बाध रूप से कैप्चर और स्टिच करें। अपने कैप्चर को तुरंत देखें, डाउनलोड करें या कॉपी करें।",
    "description": "एक्सटेंशन का विपणन विवरण, लाभ और उपयोग में आसानी पर ध्यान केंद्रित करता है।"
  },
  "actionTitle": {
    "message": "वीव के साथ कैप्चर करें",
    "description": "ब्राउज़र एक्शन बटन के लिए टूलटिप। छोटा, ब्रांडेड और एक्शन-ओरिएंटेड।"
  },
  "optionsTitle": {
    "message": "वीव सेटिंग्स",
    "description": "विकल्प पृष्ठ के ब्राउज़र टैब का शीर्षक।"
  },
  "optionsHeader": {
    "message": "सेटिंग्स",
    "description": "विकल्प पृष्ठ पर मुख्य हेडर। स्वच्छ और सरल।"
  },
  "defaultActionHeader": {
    "message": "कैप्चर करने के बाद...",
    "description": "डिफ़ॉल्ट एक्शन सेटिंग के लिए हेडर। अधिक सहज और वर्कफ़्लो-ओरिएंटेड।"
  },
  "defaultActionDescription": {
    "message": "चुनें कि कैप्चर समाप्त होने पर वीव क्या करता है।",
    "description": "डिफ़ॉल्ट एक्शन सेटिंग के लिए विवरण।"
  },
  "openViewerLabel": {
    "message": "व्यूअर खोलें",
    "description": "'व्यूअर में खोलें' रेडियो बटन के लिए लेबल। स्पष्ट और सीधा।"
  },
  "downloadLabel": {
    "message": "डाउनलोड करें",
    "description": "'डाउनलोड' रेडियो बटन के लिए लेबल। सार्वभौमिक रूप से समझा जाता है।"
  },
  "copyLabel": {
    "message": "कॉपी करें",
    "description": "'कॉपी' रेडियो बटन के लिए लेबल। UI स्थिरता के लिए संक्षिप्त।"
  },
  "saveAsHeader": {
    "message": "सहेजने से पहले पूछें",
    "description": "'इस रूप में सहेजें' टॉगल के लिए हेडर। उपयोगकर्ता के दृष्टिकोण से वाक्यांश।",
    "placeholders": {}
  },
  "saveAsDescription": {
    "message": "यदि सक्षम किया गया है, तो आपको प्रत्येक डाउनलोड के लिए एक फ़ाइल नाम और स्थान चुनने के लिए कहा जाएगा।",
    "description": "'इस रूप में सहेजें' टॉगल के लिए विवरण। सक्रिय आवाज का उपयोग करता है।"
  },
  "scrollingHeader": {
    "message": "स्क्रॉलिंग कैप्चर सक्षम करें",
    "description": "स्क्रॉलिंग कैप्चर टॉगल सेटिंग के लिए हेडर।"
  },
  "scrollingDescription": {
    "message": "पूरे स्क्रॉलिंग पृष्ठ को कैप्चर करने के लिए सक्षम करें। केवल वर्तमान में दिखाई देने वाले क्षेत्र को कैप्चर करने के लिए अक्षम करें।",
    "description": "स्क्रॉलिंग कैप्चर टॉगल के लिए विवरण। अधिक प्रत्यक्ष और अनिवार्य।"
  },
  "supportHeader": {
    "message": "इस परियोजना का समर्थन करें",
    "description": "समर्थन/प्रायोजन अनुभाग के लिए हेडर। अधिक व्यक्तिगत और समुदाय-केंद्रित।"
  },
  "supportDescription": {
    "message": "वीव एक मुफ्त, ओपन-सोर्स प्रोजेक्ट है। यदि आपको यह उपयोगी लगता है, तो कृपया इसके निरंतर विकास का समर्थन करने पर विचार करें।",
    "description": "समर्थन अनुभाग के लिए विवरण। मूल्य प्रस्ताव (FOSS) पर प्रकाश डालता है।"
  },
  "sponsorButton": {
    "message": "GitHub पर प्रायोजित करें",
    "description": "प्रायोजक बटन के लिए पाठ।"
  },
  "viewerTitle": {
    "message": "वीव: कैप्चर पूर्ण",
    "description": "स्क्रीनशॉट व्यूअर पृष्ठ के ब्राउज़र टैब का शीर्षक।"
  },
  "viewerHeader": {
    "message": "कैप्चर पूर्ण",
    "description": "व्यूअर पृष्ठ पर मुख्य हेडर, सफलता की पुष्टि करता है।"
  },
  "viewerDescription": {
    "message": "आपका पूर्ण-पृष्ठ स्क्रीनशॉट तैयार है। आगे क्या?",
    "description": "व्यूअर पृष्ठ पर विवरण, उपयोगकर्ता को संलग्न करता है।"
  },
  "copyButton": {
    "message": "छवि कॉपी करें",
    "description": "व्यूअर पृष्ठ पर कॉपी बटन के लिए पाठ।"
  },
  "copiedButton": {
    "message": "कॉपी किया गया!",
    "description": "एक सफल कॉपी के बाद कॉपी बटन के लिए पाठ, स्पष्ट प्रतिक्रिया प्रदान करता है।"
  },
  "downloadButton": {
    "message": "छवि डाउनलोड करें",
    "description": "व्यूअर पृष्ठ पर डाउनलोड बटन के लिए पाठ।"
  },
  "downloadingButton": {
    "message": "डाउनलोड हो रहा है...",
    "description": "डाउनलोड प्रगति पर होने पर डाउनलोड बटन के लिए पाठ।"
  },
  "errorButton": {
    "message": "विफल",
    "description": "जब कोई त्रुटि होती है तो एक बटन के लिए पाठ। 'त्रुटि' से कम खतरनाक।"
  },
  "screenshotAltText": {
    "message": "वीव द्वारा कैप्चर किया गया एक पूर्ण-पृष्ठ स्क्रीनशॉट।",
    "description": "स्क्रीनशॉट छवि के लिए वैकल्पिक पाठ, पहुंच और ब्रांडिंग में सुधार करता है।"
  },
  "noScreenshotAltText": {
    "message": "कोई स्क्रीनशॉट डेटा नहीं मिला। कृपया पिछले टैब पर वापस जाएं और फिर से कैप्चर करने का प्रयास करें।",
    "description": "जब कोई स्क्रीनशॉट उपलब्ध नहीं होता है तो छवि क्षेत्र के लिए वैकल्पिक पाठ, एक स्पष्ट निर्देश प्रदान करता है।"
  },
  "copyFailedError": {
    "message": "छवि को क्लिपबोर्ड पर कॉपी नहीं किया जा सका। कारण: $details$",
    "description": "क्लिपबोर्ड पर कॉपी करने में विफल होने पर दिखाया गया त्रुटि संदेश। नरम भाषा।",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "क्लिपबोर्ड एक्सेस अस्वीकृत।"
      }
    }
  },
  "screenshotGenericError": {
    "message": "कैप्चर प्रक्रिया के दौरान कुछ गलत हो गया। त्रुटि: $details$",
    "description": "स्क्रीनशॉट विफल होने पर दिखाया गया सामान्य त्रुटि संदेश। अधिक मानव-पठनीय।",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "कैनवास बनाने में विफल।"
      }
    }
  },
  "captureCancelledError": {
    "message": "कैप्चर रद्द कर दिया गया क्योंकि आपने नेविगेट किया। पूर्ण-पृष्ठ कैप्चर के लिए, कृपया वीव समाप्त होने तक टैब पर बने रहें।",
    "description": "जब उपयोगकर्ता टैब स्विच करता है तो दिखाया गया त्रुटि संदेश। बताता है *क्यों* और विनम्रता से निर्देश देता है।"
  }
}
