{
  "extName": {
    "message": "Weave: Снимка и заснемане на цяла страница",
    "description": "Официалното име на разширението. Запазено е кратко за видимост в уеб магазина и брандиране."
  },
  "extDescription": {
    "message": "Безпроблемно заснемайте и съшивайте превъртащи се екранни снимки на цяла страница с едно кликване. Незабавно преглеждайте, изтегляйте или копирайте вашите заснемания.",
    "description": "Маркетинговото описание на разширението, фокусирано върху ползите и лекотата на използване."
  },
  "actionTitle": {
    "message": "Заснемане с Weave",
    "description": "Подсказка за бутона за действие на браузъра. Кратко, брандирано и ориентирано към действие."
  },
  "optionsTitle": {
    "message": "Настройки на Weave",
    "description": "Заглавие на раздела на браузъра на страницата с опции."
  },
  "optionsHeader": {
    "message": "Настройки",
    "description": "Основен заглавен текст на страницата с опции. Изчистено и просто."
  },
  "defaultActionHeader": {
    "message": "След заснемане...",
    "description": "Заглавен текст за настройката на действието по подразбиране. По-интуитивно и ориентирано към работния процес."
  },
  "defaultActionDescription": {
    "message": "Изберете какво да прави Weave в момента, в който заснемането приключи.",
    "description": "Описание на настройката за действие по подразбиране."
  },
  "openViewerLabel": {
    "message": "Отваряне на преглед",
    "description": "Етикет за радио бутона 'отваряне в преглед'. Ясно и директно."
  },
  "downloadLabel": {
    "message": "Изтегляне",
    "description": "Етикет за радио бутона 'изтегляне'. Универсално разбираемо."
  },
  "copyLabel": {
    "message": "Копиране",
    "description": "Етикет за радио бутона 'копиране'. Сбито за последователност на потребителския интерфейс."
  },
  "saveAsHeader": {
    "message": "Питай преди запазване",
    "description": "Заглавен текст за превключвателя 'запазване като'. Формулирано от гледна точка на потребителя."
  },
  "saveAsDescription": {
    "message": "Ако е активирано, ще бъдете подканени да изберете име на файл и местоположение за всяко изтегляне.",
    "description": "Описание на превключвателя 'запазване като'. Използва деятелен залог."
  },
  "scrollingHeader": {
    "message": "Активиране на заснемане с превъртане",
    "description": "Заглавен текст за настройката на превключвателя за заснемане с превъртане."
  },
  "scrollingDescription": {
    "message": "Активирайте, за да заснемете цялата превъртаща се страница. Деактивирайте, за да заснемете само текущо видимата област.",
    "description": "Описание на превключвателя за заснемане с превъртане. По-директно и императивно."
  },
  "supportHeader": {
    "message": "Подкрепете този проект",
    "description": "Заглавен текст за секцията за подкрепа/спонсорство. По-лично и ориентирано към общността."
  },
  "supportDescription": {
    "message": "Weave е безплатен проект с отворен код. Ако го намирате за полезен, моля, обмислете подкрепата за неговото продължаващо развитие.",
    "description": "Описание на секцията за подкрепа. Подчертава предложението за стойност (FOSS)."
  },
  "sponsorButton": {
    "message": "Спонсорирайте в GitHub",
    "description": "Текст за бутона за спонсориране."
  },
  "viewerTitle": {
    "message": "Weave: Заснемането е завършено",
    "description": "Заглавие на раздела на браузъра на страницата за преглед на екранни снимки."
  },
  "viewerHeader": {
    "message": "Заснемането е завършено",
    "description": "Основен заглавен текст на страницата за преглед, потвърждаващ успеха."
  },
  "viewerDescription": {
    "message": "Вашата екранна снимка на цяла страница е готова. Какво следва?",
    "description": "Описание на страницата за преглед, ангажиращо потребителя."
  },
  "copyButton": {
    "message": "Копиране на изображение",
    "description": "Текст за бутона за копиране на страницата за преглед."
  },
  "copiedButton": {
    "message": "Копирано!",
    "description": "Текст за бутона за копиране след успешно копиране, предоставящ ясна обратна връзка."
  },
  "downloadButton": {
    "message": "Изтегляне на изображение",
    "description": "Текст за бутона за изтегляне на страницата за преглед."
  },
  "downloadingButton": {
    "message": "Изтегляне...",
    "description": "Текст за бутона за изтегляне, докато изтеглянето е в ход."
  },
  "errorButton": {
    "message": "Неуспешно",
    "description": "Текст за бутон, когато възникне грешка. По-малко тревожно от 'Грешка'."
  },
  "screenshotAltText": {
    "message": "Екранна снимка на цяла страница, заснета от Weave.",
    "description": "Алтернативен текст за изображението на екранната снимка, подобряващ достъпността и брандирането."
  },
  "noScreenshotAltText": {
    "message": "Не са намерени данни за екранна снимка. Моля, върнете се в предишния раздел и опитайте да заснемете отново.",
    "description": "Алтернативен текст за областта на изображението, когато няма налична екранна снимка, предоставящ ясни инструкции."
  },
  "copyFailedError": {
    "message": "Не може да се копира изображението в клипборда. Причина: $details$",
    "description": "Съобщение за грешка, което се показва, когато копирането в клипборда е неуспешно. По-мек език.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Достъпът до клипборда е отказан."
      }
    }
  },
  "screenshotGenericError": {
    "message": "Нещо се обърка по време на процеса на заснемане. Грешка: $details$",
    "description": "Общо съобщение за грешка, което се показва, когато заснемането на екрана е неуспешно. По-разбираемо за човека.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Неуспешно създаване на платно."
      }
    }
  },
  "captureCancelledError": {
    "message": "Заснемането е отменено, защото сте се отместили. За заснемане на цяла страница, моля, останете в раздела, докато Weave приключи.",
    "description": "Съобщение за грешка, което се показва, когато потребителят смени разделите. Обяснява *защо* и учтиво инструктира."
  }
}
