{
  "extName": {
    "message": "Weave: Скриншот и захват всей страницы",
    "description": "Официальное название расширения. Краткое для заметности в интернет-магазине и брендинга."
  },
  "extDescription": {
    "message": "Бесшовно захватывайте и сшивайте прокручиваемые скриншоты всей страницы одним щелчком мыши. Мгновенно просматривайте, загружайте или копируйте свои снимки.",
    "description": "Маркетинговое описание расширения, ориентированное на преимущества и простоту использования."
  },
  "actionTitle": {
    "message": "Захватить с помощью Weave",
    "description": "Подсказка для кнопки действия браузера. Короткая, брендированная и ориентированная на действие."
  },
  "optionsTitle": {
    "message": "Настройки Weave",
    "description": "Заголовок вкладки браузера страницы настроек."
  },
  "optionsHeader": {
    "message": "Настройки",
    "description": "Основной заголовок на странице настроек. Чистый и простой."
  },
  "defaultActionHeader": {
    "message": "После захвата...",
    "description": "Заголовок для настройки действия по умолчанию. Более интуитивный и ориентированный на рабочий процесс."
  },
  "defaultActionDescription": {
    "message": "Выберите, что Weave будет делать в тот момент, когда захват будет завершен.",
    "description": "Описание настройки действия по умолчанию."
  },
  "openViewerLabel": {
    "message": "Открыть в просмотрщике",
    "description": "Метка для радиокнопки «открыть в просмотрщике». Четкая и прямая."
  },
  "downloadLabel": {
    "message": "Скачать",
    "description": "Метка для радиокнопки «скачать». Понятно во всем мире."
  },
  "copyLabel": {
    "message": "Копировать",
    "description": "Метка для радиокнопки «копировать». Краткая для единообразия пользовательского интерфейса."
  },
  "saveAsHeader": {
    "message": "Спрашивать перед сохранением",
    "description": "Заголовок для переключателя «сохранить как». Сформулировано с точки зрения пользователя."
  },
  "saveAsDescription": {
    "message": "Если включено, вам будет предложено выбрать имя файла и местоположение для каждой загрузки.",
    "description": "Описание для переключателя «сохранить как». Использует действительный залог."
  },
  "scrollingHeader": {
    "message": "Включить захват с прокруткой",
    "description": "Заголовок для настройки переключателя захвата с прокруткой."
  },
  "scrollingDescription": {
    "message": "Включите, чтобы захватить всю прокручиваемую страницу. Отключите, чтобы захватить только видимую в данный момент область.",
    "description": "Описание для переключателя захвата с прокруткой. Более прямое и повелительное."
  },
  "supportHeader": {
    "message": "Поддержать этот проект",
    "description": "Заголовок для раздела поддержки/спонсорства. Более личный и ориентированный на сообщество."
  },
  "supportDescription": {
    "message": "Weave — это бесплатный проект с открытым исходным кодом. Если вы считаете его полезным, пожалуйста, рассмотрите возможность поддержки его дальнейшего развития.",
    "description": "Описание для раздела поддержки. Подчеркивает ценностное предложение (FOSS)."
  },
  "sponsorButton": {
    "message": "Спонсировать на GitHub",
    "description": "Текст для кнопки спонсора."
  },
  "viewerTitle": {
    "message": "Weave: Захват завершен",
    "description": "Заголовок вкладки браузера страницы просмотра скриншотов."
  },
  "viewerHeader": {
    "message": "Захват завершен",
    "description": "Основной заголовок на странице просмотра, подтверждающий успех."
  },
  "viewerDescription": {
    "message": "Ваш скриншот всей страницы готов. Что дальше?",
    "description": "Описание на странице просмотра, вовлекающее пользователя."
  },
  "copyButton": {
    "message": "Копировать изображение",
    "description": "Текст для кнопки копирования на странице просмотра."
  },
  "copiedButton": {
    "message": "Скопировано!",
    "description": "Текст для кнопки копирования после успешного копирования, обеспечивающий четкую обратную связь."
  },
  "downloadButton": {
    "message": "Скачать изображение",
    "description": "Текст для кнопки загрузки на странице просмотра."
  },
  "downloadingButton": {
    "message": "Загрузка...",
    "description": "Текст для кнопки загрузки во время загрузки."
  },
  "errorButton": {
    "message": "Не удалось",
    "description": "Текст для кнопки при возникновении ошибки. Менее тревожный, чем «Ошибка»."
  },
  "screenshotAltText": {
    "message": "Скриншот всей страницы, сделанный Weave.",
    "description": "Альтернативный текст для изображения скриншота, улучшающий доступность и брендинг."
  },
  "noScreenshotAltText": {
    "message": "Данные скриншота не найдены. Вернитесь на предыдущую вкладку и повторите попытку захвата.",
    "description": "Альтернативный текст для области изображения, когда скриншот недоступен, с четкой инструкцией."
  },
  "copyFailedError": {
    "message": "Не удалось скопировать изображение в буфер обмена. Причина: $details$",
    "description": "Сообщение об ошибке, отображаемое при сбое копирования в буфер обмена. Более мягкий язык.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Доступ к буферу обмена запрещен."
      }
    }
  },
  "screenshotGenericError": {
    "message": "Что-то пошло не так во время процесса захвата. Ошибка: $details$",
    "description": "Общее сообщение об ошибке, отображаемое при сбое создания скриншота. Более удобочитаемое для человека.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Не удалось создать холст."
      }
    }
  },
  "captureCancelledError": {
    "message": "Захват отменен, так как вы перешли на другую страницу. Для захвата всей страницы оставайтесь на вкладке, пока Weave не закончит.",
    "description": "Сообщение об ошибке, отображаемое при переключении вкладок пользователем. Объясняет, *почему*, и вежливо инструктирует."
  }
}
