{
  "extName": {
    "message": "Weave: Знімок екрана та захоплення всієї сторінки",
    "description": "Офіційна назва розширення. Зберігається лаконічною для видимості у веб-магазині та брендингу."
  },
  "extDescription": {
    "message": "Безперешкодно захоплюйте та зшивайте прокручувані знімки екрана всієї сторінки одним клацанням миші. Миттєво переглядайте, завантажуйте або копіюйте свої знімки.",
    "description": "Маркетинговий опис розширення, зосереджений на перевагах та простоті використання."
  },
  "actionTitle": {
    "message": "Захопити за допомогою Weave",
    "description": "Підказка для кнопки дії браузера. Коротка, брендована та орієнтована на дію."
  },
  "optionsTitle": {
    "message": "Налаштування Weave",
    "description": "Заголовок вкладки браузера сторінки налаштувань."
  },
  "optionsHeader": {
    "message": "Налаштування",
    "description": "Основний заголовок на сторінці налаштувань. Чистий і простий."
  },
  "defaultActionHeader": {
    "message": "Після захоплення...",
    "description": "Заголовок для налаштування дії за замовчуванням. Більш інтуїтивний та орієнтований на робочий процес."
  },
  "defaultActionDescription": {
    "message": "Виберіть, що Weave робитиме в той момент, коли захоплення буде завершено.",
    "description": "Опис налаштування дії за замовчуванням."
  },
  "openViewerLabel": {
    "message": "Відкрити у переглядачі",
    "description": "Мітка для радіокнопки «відкрити у переглядачі». Чітка та пряма."
  },
  "downloadLabel": {
    "message": "Завантажити",
    "description": "Мітка для радіокнопки «завантажити». Зрозуміло в усьому світі."
  },
  "copyLabel": {
    "message": "Копіювати",
    "description": "Мітка для радіокнопки «копіювати». Лаконічна для узгодженості інтерфейсу користувача."
  },
  "saveAsHeader": {
    "message": "Запитувати перед збереженням",
    "description": "Заголовок для перемикача «зберегти як». Сформульовано з точки зору користувача."
  },
  "saveAsDescription": {
    "message": "Якщо ввімкнено, вам буде запропоновано вибрати ім'я файлу та місцезнаходження для кожного завантаження.",
    "description": "Опис для перемикача «зберегти як». Використовує активний стан."
  },
  "scrollingHeader": {
    "message": "Увімкнути захоплення з прокручуванням",
    "description": "Заголовок для налаштування перемикача захоплення з прокручуванням."
  },
  "scrollingDescription": {
    "message": "Увімкніть, щоб захопити всю прокручувану сторінку. Вимкніть, щоб захопити лише видиму на даний момент область.",
    "description": "Опис для перемикача захоплення з прокручуванням. Більш прямий та імперативний."
  },
  "supportHeader": {
    "message": "Підтримати цей проект",
    "description": "Заголовок для розділу підтримки/спонсорства. Більш особистий та орієнтований на спільноту."
  },
  "supportDescription": {
    "message": "Weave — це безкоштовний проект з відкритим вихідним кодом. Якщо ви вважаєте його корисним, будь ласка, розгляньте можливість підтримки його подальшого розвитку.",
    "description": "Опис для розділу підтримки. Підкреслює ціннісну пропозицію (FOSS)."
  },
  "sponsorButton": {
    "message": "Спонсорувати на GitHub",
    "description": "Текст для кнопки спонсора."
  },
  "viewerTitle": {
    "message": "Weave: Захоплення завершено",
    "description": "Заголовок вкладки браузера сторінки перегляду знімків екрана."
  },
  "viewerHeader": {
    "message": "Захоплення завершено",
    "description": "Основний заголовок на сторінці перегляду, що підтверджує успіх."
  },
  "viewerDescription": {
    "message": "Ваш знімок екрана всієї сторінки готовий. Що далі?",
    "description": "Опис на сторінці перегляду, що залучає користувача."
  },
  "copyButton": {
    "message": "Копіювати зображення",
    "description": "Текст для кнопки копіювання на сторінці перегляду."
  },
  "copiedButton": {
    "message": "Скопійовано!",
    "description": "Текст для кнопки копіювання після успішного копіювання, що забезпечує чіткий зворотний зв'язок."
  },
  "downloadButton": {
    "message": "Завантажити зображення",
    "description": "Текст для кнопки завантаження на сторінці перегляду."
  },
  "downloadingButton": {
    "message": "Завантаження...",
    "description": "Текст для кнопки завантаження під час завантаження."
  },
  "errorButton": {
    "message": "Не вдалося",
    "description": "Текст для кнопки при виникненні помилки. Менш тривожний, ніж «Помилка»."
  },
  "screenshotAltText": {
    "message": "Знімок екрана всієї сторінки, зроблений Weave.",
    "description": "Альтернативний текст для зображення знімка екрана, що покращує доступність та брендинг."
  },
  "noScreenshotAltText": {
    "message": "Дані знімка екрана не знайдено. Поверніться на попередню вкладку та повторіть спробу захоплення.",
    "description": "Альтернативний текст для області зображення, коли знімок екрана недоступний, з чіткою інструкцією."
  },
  "copyFailedError": {
    "message": "Не вдалося скопіювати зображення в буфер обміну. Причина: $details$",
    "description": "Повідомлення про помилку, що відображається при збої копіювання в буфер обміну. Більш м'яка мова.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Доступ до буфера обміну заборонено."
      }
    }
  },
  "screenshotGenericError": {
    "message": "Щось пішло не так під час процесу захоплення. Помилка: $details$",
    "description": "Загальне повідомлення про помилку, що відображається при збої створення знімка екрана. Більш читабельне для людини.",
    "placeholders": {
      "details": {
        "content": "$1",
        "example": "Не вдалося створити полотно."
      }
    }
  },
  "captureCancelledError": {
    "message": "Захоплення скасовано, оскільки ви перейшли на іншу сторінку. Для захоплення всієї сторінки залишайтеся на вкладці, доки Weave не закінчить.",
    "description": "Повідомлення про помилку, що відображається при перемиканні вкладок користувачем. Пояснює, *чому*, і ввічливо інструктує."
  }
}
